# назначаем словари
name_dict = {
        "Пушкин": "01.11.1988",
        "Путин": "02.02.1952",
        "Ленин": "03.07.1985",
        "Сталин": "04.03.1931",
        "Черчиль": "08.09.1901"
        }
days = {
    "01": "первое",
    "02": "второе",
    "03": "третье",
    "04": "четвертое",
    "05": "пятое",
    "06": "шестое",
    "07": "седьмое",
    "08": "восьмое",
    "09": "девятое",
    "10": "десятое",
}

months ={
    "01": "января",
    "02": "февраля",
    "03": "марта",
    "04": "апреля",
    "07": "июля",
    "09": "сентября",
    "11": "ноября"
}
# достаем рандомные значение имени

import random
name_man = ["Пушкин", "Путин", "Ленин", "Сталин", "Черчиль"]
name_random_list = random.sample(name_man, 2)
print(name_random_list)

# переменные для викторины
input_date = []
true_answer = 0
false_answer = 0

while True:
    for i in list(name_random_list): # проводим по циклу имя
        print("Выбран человек: ", i)
        birth_date = input("Введите дату его рождения в формате день.месяц.год\nНапример - (01.01.1901)\nВведите дату:\n ")
        if birth_date in name_dict[i]: # проверяем совпадает ли эта дата с датой рожнения
            print("Верно, совпадает\n")
            true_answer =+ 1
        else:
            print("Ты не угадал")
            date = str(name_dict[i])
            day, month, year = date.split(".")
            print("Его дата - ", days[day], months[month], year, "года\n")
            false_answer += 1
    print("Правильных ответов: ", true_answer, "\nНе правильных ответов: ", false_answer, "\n")
    restart = input("Сыграм еще? (да/нет):\n")
    if restart == ("да"):
        print("Отлично, поехали заново!!!\n")
        print("*"*15, "\n")
    else:
        break
print("END")